
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>1.3. 排序算法 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="原型原型链继承.html" />
    
    
    <link rel="prev" href="执行上下文.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" >
            
                <a target="_blank" href="https://github.com/liuzuan">
            
                    
                    My GitHub
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" >
            
                <a target="_blank" href="http://liuzuann.com">
            
                    
                    个人简历
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="../">
            
                <a href="../">
            
                    
                    前言
            
                </a>
            

            
        </li>
    

    
        
        <li class="divider"></li>
        
        
    
        <li class="chapter " data-level="2.1" data-path="./">
            
                <a href="./">
            
                    
                    1. JAVASCRIPT
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="2.1.1" data-path="let与Var.html">
            
                <a href="let与Var.html">
            
                    
                    1.1. let与var
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.1.2" data-path="执行上下文.html">
            
                <a href="执行上下文.html">
            
                    
                    1.2. 执行上下文
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="2.1.3" data-path="排序算法.html">
            
                <a href="排序算法.html">
            
                    
                    1.3. 排序算法
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.1.4" data-path="原型原型链继承.html">
            
                <a href="原型原型链继承.html">
            
                    
                    1.4. 原型、原型链、继承
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="2.2" data-path="../css/">
            
                <a href="../css/">
            
                    
                    2. CSS
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="2.2.1" data-path="../css/bfc.html">
            
                <a href="../css/bfc.html">
            
                    
                    2.1. bfc
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="2.3" >
            
                <span>
            
                    
                    3. github使用
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="2.3.1" data-path="../github/build包push.html">
            
                <a href="../github/build包push.html">
            
                    
                    3.1. 打包并且push到分支
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="2.4" >
            
                <span>
            
                    
                    4. 移动端问题
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="2.4.1" data-path="../移动端/点击穿透.html">
            
                <a href="../移动端/点击穿透.html">
            
                    
                    4.1. 点击穿透问题
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="2.5" >
            
                <span>
            
                    
                    4. 兼容问题
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="2.5.1" data-path="../兼容问题/ie.html">
            
                <a href="../兼容问题/ie.html">
            
                    
                    ie兼容
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="2.6" >
            
                <span>
            
                    
                    5. svn使用
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="2.6.1" data-path="../svn/svn基本命令.html">
            
                <a href="../svn/svn基本命令.html">
            
                    
                    5.1. svn基本命令
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="2.7" >
            
                <span>
            
                    
                    6. vue
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="2.7.1" data-path="../vue/v-model.html">
            
                <a href="../vue/v-model.html">
            
                    
                    6.1. v-model双向绑定实现
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="2.8" >
            
                <span>
            
                    
                    7. es6
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="2.8.1" data-path="../es6目录/">
            
                <a href="../es6目录/">
            
                    
                    7.1. es6目录
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >1.3. 排序算法</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x6392;&#x5E8F;&#x7B97;&#x6CD5;"><font color="#0099ff" size="5" face="&#x9ED1;&#x4F53;">&#x6392;&#x5E8F;&#x7B97;&#x6CD5;</font></h1>
<h3 id="&#x4E00;&#x3001;&#x5FEB;&#x901F;&#x6392;&#x5E8F;">&#x4E00;&#x3001;&#x5FEB;&#x901F;&#x6392;&#x5E8F;</h3>
<p>&#x5FEB;&#x901F;&#x6392;&#x5E8F;&#x662F;&#x5904;&#x7406;&#x5927;&#x6570;&#x636E;&#x6700;&#x5FEB;&#x7684;&#x6392;&#x5E8F;&#x7B97;&#x6CD5;&#x4E4B;&#x4E00;&#xFF0C;&#x5B83;&#x4E5F;&#x662F;&#x4E00;&#x79CD;&#x5206;&#x800C;&#x6CBB;&#x4E4B;&#x7684;&#x7B97;&#x6CD5;&#xFF0C;&#x901A;&#x8FC7;&#x9012;&#x5F52;&#x65B9;&#x5F0F;&#x5C06;&#x6570;&#x636E;&#x4F9D;&#x6B21;&#x5206;&#x89E3;&#x4E3A;&#x5305;&#x542B;&#x8F83;&#x5C0F;&#x5143;&#x7D20;&#x548C;&#x8F83;&#x5927;&#x5143;&#x7D20;&#x7684;&#x4E0D;&#x540C;&#x5B50;&#x5E8F;&#x5217;&#xFF0C;&#x4F1A;&#x4E0D;&#x65AD;&#x91CD;&#x590D;&#x8FD9;&#x4E2A;&#x6B65;&#x9AA4;&#xFF0C;&#x76F4;&#x5230;&#x6240;&#x6709;&#x7684;&#x5E8F;&#x5217;&#x5168;&#x90E8;&#x4E3A;&#x6709;&#x5E8F;&#x7684;&#xFF0C;&#x6700;&#x540E;&#x5C06;&#x8FD9;&#x4E9B;&#x5B50;&#x5E8F;&#x5217;&#x4E00;&#x6B21;&#x62FC;&#x63A5;&#x8D77;&#x6765;&#xFF0C;&#x5C31;&#x53EF;&#x5F97;&#x5230;&#x6392;&#x5E8F;&#x597D;&#x7684;&#x6570;&#x636E;&#x3002;</p>
<p>&#x8BE5;&#x7B97;&#x6CD5;&#x9996;&#x5148;&#x8981;&#x4ECE;&#x6570;&#x5217;&#x4E2D;&#x9009;&#x51FA;&#x4E00;&#x4E2A;&#x5143;&#x7D20;&#x4F5C;&#x4E3A;&#x57FA;&#x6570;&#xFF08;pivot&#xFF09;&#x3002;&#x63A5;&#x7740;&#x6240;&#x6709;&#x7684;&#x6570;&#x636E;&#x90FD;&#x5C06;&#x56F4;&#x7ED5;&#x8FD9;&#x4E2A;&#x57FA;&#x6570;&#x8FDB;&#x884C;&#xFF0C;&#x5C06;&#x5C0F;&#x4E8E;&#x6539;&#x57FA;&#x6570;&#x7684;&#x5143;&#x7D20;&#x653E;&#x5728;&#x5B83;&#x7684;&#x5DE6;&#x8FB9;&#xFF0C;&#x5927;&#x4E8E;&#x6216;&#x7B49;&#x4E8E;&#x5B83;&#x7684;&#x6570;&#x5168;&#x90E8;&#x653E;&#x5728;&#x5B83;&#x7684;&#x53F3;&#x8FB9;&#xFF0C;&#x5BF9;&#x5DE6;&#x53F3;&#x4E24;&#x4E2A;&#x5C0F;&#x6570;&#x5217;&#x91CD;&#x590D;&#x4E0A;&#x8FF0;&#x6B65;&#x9AA4;&#xFF0C;&#x76F4;&#x81F3;&#x5404;&#x533A;&#x95F4;&#x53EA;&#x6709;1&#x4E2A;&#x6570;&#x3002;</p>
<pre><code>function quickSort(arr) {
  if (arr.length &lt; 2) return arr;
  let mid = Math.floor(arr.length / 2)
  let midValue = arr.splice(mid, 1)
  let left = [] 
  let right= [] 
  for (let i of arr) {
    if (i &lt; midValue) {
      left.push(i)
    } else {
      right.push(i)
    }
  }
  return quickSort(left).concat(midValue, quickSort(right))
}
console.log(quickSort([2, 5, 7, 3, 1, 5, 8, 3, 9, 2, 0]))`
</code></pre><h3 id="&#x4E8C;&#x3001;&#x5192;&#x6CE1;&#x6392;&#x5E8F;">&#x4E8C;&#x3001;&#x5192;&#x6CE1;&#x6392;&#x5E8F;</h3>
<p>&#x5192;&#x6CE1;&#x6392;&#x5E8F;&#x662F;&#x6BD4;&#x8F83;&#x7ECF;&#x5178;&#x7684;&#x7B97;&#x6CD5;&#x4E4B;&#x4E00;&#xFF0C;&#x4E5F;&#x662F;&#x6392;&#x5E8F;&#x6700;&#x6162;&#x7684;&#x7B97;&#x6CD5;&#x4E4B;&#x4E00;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x7684;&#x5B9E;&#x73B0;&#x662F;&#x975E;&#x5E38;&#x7684;&#x5BB9;&#x6613;&#x7684;&#x3002;</p>
<p>&#x5192;&#x6CE1;&#x6392;&#x5E8F;&#x7684;&#x7B97;&#x6CD5;&#x601D;&#x60F3;&#x5982;&#x4E0B;&#xFF08;&#x5347;&#x5E8F;&#x6392;&#x5E8F;&#xFF09;&#xFF1A;</p>
<ol>
<li>&#x6BD4;&#x8F83;&#x76F8;&#x90BB;&#x7684;&#x5143;&#x7D20;&#x3002;&#x5982;&#x679C;&#x7B2C;&#x4E00;&#x4E2A;&#x6BD4;&#x7B2C;&#x4E8C;&#x4E2A;&#x5927;&#xFF0C;&#x5C31;&#x4EA4;&#x6362;&#x5B83;&#x4EEC;&#x4E24;&#x4E2A;&#xFF1B;</li>
<li>&#x5BF9;&#x6BCF;&#x4E00;&#x5BF9;&#x76F8;&#x90BB;&#x5143;&#x7D20;&#x4F5C;&#x540C;&#x6837;&#x7684;&#x5DE5;&#x4F5C;&#xFF0C;&#x4ECE;&#x5F00;&#x59CB;&#x7B2C;&#x4E00;&#x5BF9;&#x5230;&#x7ED3;&#x5C3E;&#x7684;&#x6700;&#x540E;&#x4E00;&#x5BF9;&#xFF0C;&#x8FD9;&#x6837;&#x6700;&#x7EC8;&#x6700;&#x5927;&#x6570;&#x88AB;&#x4EA4;&#x6362;&#x5230;&#x6700;&#x540E;&#x7684;&#x4F4D;&#x7F6E;</li>
<li>&#x9664;&#x4E86;&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x5143;&#x7D20;&#x4EE5;&#x5916;&#xFF0C;&#x9488;&#x5BF9;&#x6240;&#x6709;&#x7684;&#x5143;&#x7D20;&#x91CD;&#x590D;&#x4EE5;&#x4E0A;&#x7684;&#x6B65;&#x9AA4;</li>
<li>&#x91CD;&#x590D;&#x6B65;&#x9AA4;1~3&#xFF0C;&#x76F4;&#x5230;&#x6392;&#x5E8F;&#x5B8C;&#x6210;</li>
</ol>
<pre><code>function bubbleSort(arr) {
  let i = arr.length;
  for (i; i &gt; 0; i--) {
    for (let j = 0; j &lt; i - 1; j++) {
      console.log(j)
      if (arr[j] &gt; arr[j + 1]) {
        [arr[j], arr[j + 1]] = [arr[j + 1], arr[j]]
      }
    }
  }
  return arr
}
console.log(bubbleSort([2, 4, 6, 80, 100, 5, 0]))
</code></pre><h3 id="&#x4E09;&#x3001;&#x9009;&#x62E9;&#x6392;&#x5E8F;">&#x4E09;&#x3001;&#x9009;&#x62E9;&#x6392;&#x5E8F;</h3>
<p>&#x9009;&#x62E9;&#x6392;&#x5E8F;&#x662F;&#x4E00;&#x79CD;&#x6BD4;&#x8F83;&#x7B80;&#x5355;&#x76F4;&#x89C2;&#x7684;&#x6392;&#x5E8F;&#x7B97;&#x6CD5;&#x3002;&#x5B83;&#x7684;&#x7B97;&#x6CD5;&#x601D;&#x60F3;&#x662F;&#xFF0C;&#x4ECE;&#x6570;&#x7EC4;&#x7684;&#x5F00;&#x5934;&#x5F00;&#x59CB;&#x904D;&#x5386;&#xFF0C;&#x5C06;&#x7B2C;&#x4E00;&#x4E2A;&#x5143;&#x7D20;&#x548C;&#x5176;&#x4ED6;&#x5143;&#x7D20;&#x5206;&#x522B;&#x8FDB;&#x884C;&#x6BD4;&#x8F83;&#xFF0C;&#x8BB0;&#x5F55;&#x6700;&#x5C0F;&#x7684;&#x5143;&#x7D20;&#xFF0C;&#x7B49;&#x5FAA;&#x73AF;&#x7ED3;&#x675F;&#x4E4B;&#x540E;&#xFF0C;&#x5C06;&#x6700;&#x5C0F;&#x7684;&#x5143;&#x7D20;&#x653E;&#x5230;&#x6570;&#x7EC4;&#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x4F4D;&#x7F6E;&#x4E0A;&#xFF0C;&#x7136;&#x540E;&#x4ECE;&#x6570;&#x7EC4;&#x7684;&#x7B2C;&#x4E8C;&#x4E2A;&#x4F4D;&#x7F6E;&#x5F00;&#x59CB;&#x7EE7;&#x7EED;&#x6267;&#x884C;&#x4E0A;&#x8FF0;&#x6B65;&#x9AA4;&#x3002;&#x5F53;&#x8FDB;&#x884C;&#x5230;&#x6570;&#x7EC4;&#x5012;&#x6570;&#x7B2C;&#x4E8C;&#x4E2A;&#x4F4D;&#x7F6E;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6240;&#x6709;&#x7684;&#x6570;&#x636E;&#x5C31;&#x5B8C;&#x6210;&#x4E86;&#x6392;&#x5E8F;&#x3002;</p>
<p>&#x9009;&#x62E9;&#x6392;&#x5E8F;&#x540C;&#x6837;&#x4F1A;&#x7528;&#x5230;&#x5D4C;&#x5957;&#x5FAA;&#x73AF;&#xFF0C;&#x5916;&#x5FAA;&#x73AF;&#x4ECE;&#x6570;&#x7EC4;&#x7B2C;&#x4E00;&#x4E2A;&#x4F4D;&#x7F6E;&#x79FB;&#x5230;&#x5012;&#x6570;&#x7B2C;&#x4E8C;&#x4E2A;&#x4F4D;&#x7F6E;&#xFF1B;&#x5185;&#x5FAA;&#x73AF;&#x4ECE;&#x7B2C;&#x4E8C;&#x4E2A;&#x4F4D;&#x7F6E;&#x79FB;&#x52A8;&#x5230;&#x6570;&#x7EC4;&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x4F4D;&#x7F6E;&#xFF0C;&#x67E5;&#x627E;&#x6BD4;&#x5F53;&#x524D;&#x5916;&#x5FAA;&#x73AF;&#x6240;&#x6307;&#x5411;&#x7684;&#x5143;&#x7D20;&#x8FD8;&#x8981;&#x5C0F;&#x7684;&#x5143;&#x7D20;&#xFF0C;&#x6BCF;&#x6B21;&#x5185;&#x5FAA;&#x73AF;&#x7ED3;&#x675F;&#x540E;&#xFF0C;&#x90FD;&#x4F1A;&#x5C06;&#x6700;&#x5C0F;&#x7684;&#x503C;&#x653E;&#x5230;&#x5408;&#x9002;&#x7684;&#x4F4D;&#x7F6E;&#x4E0A;&#x3002;</p>
<pre><code>function selectionSort(arr) {
  let len = arr.length;
  for (let i = 0; i &lt; len - 1; i++) {
    let min = arr[i];
    let index = i;
    for (let j = i + 1; j &lt; len; j++) {
      if (min &gt; arr[j]) {
        min = arr[j];
        index = j;
      }
    }
    [arr[i], arr[index]] = [min, arr[i]];
  }
  return arr
}
console.log(selectionSort([2, 4, 6, 80, 100, 5, 0, 1]))
</code></pre><h3 id="&#x56DB;&#x3001;&#x63D2;&#x5165;&#x6392;&#x5E8F;">&#x56DB;&#x3001;&#x63D2;&#x5165;&#x6392;&#x5E8F;</h3>
<p>&#x63D2;&#x5165;&#x6392;&#x5E8F;&#x6709;&#x70B9;&#x7C7B;&#x4F3C;&#x4EBA;&#x7C7B;&#x6309;&#x5B57;&#x6BCD;&#x987A;&#x5E8F;&#x5BF9;&#x6570;&#x636E;&#x8FDB;&#x884C;&#x6392;&#x5E8F;&#xFF0C;&#x5C31;&#x5982;&#x540C;&#x4F60;&#x6253;&#x6251;&#x514B;&#x724C;&#x4E00;&#x6837;&#xFF0C;&#x5C06;&#x6478;&#x6765;&#x7684;&#x6251;&#x514B;&#x6309;&#x5927;&#x5C0F;&#x653E;&#x5230;&#x5408;&#x9002;&#x7684;&#x4F4D;&#x7F6E;&#x4E00;&#x6837;&#x3002;&#x5B83;&#x7684;&#x539F;&#x7406;&#x5C31;&#x662F;&#x901A;&#x8FC7;&#x5D4C;&#x5957;&#x5FAA;&#x73AF;&#xFF0C;&#x5916;&#x5FAA;&#x73AF;&#x5C06;&#x6570;&#x7EC4;&#x5143;&#x7D20;&#x6328;&#x4E2A;&#x79FB;&#x52A8;&#xFF0C;&#x800C;&#x5185;&#x5FAA;&#x73AF;&#x5219;&#x5BF9;&#x5916;&#x5FAA;&#x73AF;&#x4E2D;&#x9009;&#x4E2D;&#x7684;&#x5143;&#x7D20;&#x53CA;&#x5B83;&#x540E;&#x9762;&#x7684;&#x5143;&#x7D20;&#x8FDB;&#x884C;&#x6BD4;&#x8F83;&#xFF1B;&#x5982;&#x679C;&#x5916;&#x5FAA;&#x73AF;&#x4E2D;&#x9009;&#x4E2D;&#x7684;&#x5143;&#x7D20;&#x6BD4;&#x5185;&#x5FAA;&#x73AF;&#x4E2D;&#x9009;&#x4E2D;&#x7684;&#x5143;&#x7D20;&#x5C0F;&#xFF0C;&#x90A3;&#x4E48;&#x6570;&#x7EC4;&#x5143;&#x7D20;&#x4F1A;&#x5411;&#x53F3;&#x79FB;&#x52A8;&#xFF0C;&#x4E3A;&#x5185;&#x5FAA;&#x73AF;&#x4E2D;&#x7684;&#x8FD9;&#x4E2A;&#x5143;&#x7D20;&#x817E;&#x51FA;&#x4F4D;&#x7F6E;&#x3002;</p>
<p>&#x5B9E;&#x73B0;&#x6B65;&#x9AA4;&#x5982;&#x4E0B;&#xFF1A;</p>
<ol>
<li>&#x4ECE;&#x7B2C;&#x4E00;&#x4E2A;&#x5143;&#x7D20;&#x5F00;&#x59CB;&#xFF0C;&#x8BE5;&#x5143;&#x7D20;&#x9ED8;&#x8BA4;&#x5DF2;&#x7ECF;&#x88AB;&#x6392;&#x5E8F;</li>
<li>&#x53D6;&#x51FA;&#x4E0B;&#x4E00;&#x4E2A;&#x5143;&#x7D20;&#xFF0C;&#x5728;&#x5DF2;&#x7ECF;&#x6392;&#x5E8F;&#x7684;&#x5143;&#x7D20;&#x5E8F;&#x5217;&#x4E2D;&#x4ECE;&#x540E;&#x5411;&#x524D;&#x626B;&#x63CF;</li>
<li>&#x5982;&#x679C;&#x8BE5;&#x5143;&#x7D20;&#xFF08;&#x5DF2;&#x6392;&#x5E8F;&#xFF09;&#x5927;&#x4E8E;&#x65B0;&#x5143;&#x7D20;&#xFF0C;&#x5C06;&#x8BE5;&#x5143;&#x7D20;&#x79FB;&#x5230;&#x4E0B;&#x4E00;&#x4F4D;&#x7F6E;</li>
<li>&#x91CD;&#x590D;&#x6B65;&#x9AA4;3&#xFF0C;&#x76F4;&#x5230;&#x627E;&#x5230;&#x5DF2;&#x6392;&#x5E8F;&#x7684;&#x5143;&#x7D20;&#x5C0F;&#x4E8E;&#x6216;&#x8005;&#x7B49;&#x4E8E;&#x65B0;&#x5143;&#x7D20;&#x7684;&#x4F4D;&#x7F6E;</li>
<li>&#x5C06;&#x65B0;&#x5143;&#x7D20;&#x63D2;&#x5165;&#x5230;&#x8BE5;&#x4F4D;&#x7F6E;</li>
<li>&#x91CD;&#x590D;&#x6B65;&#x9AA4;2~5&#xFF0C;&#x76F4;&#x5230;&#x6392;&#x5E8F;&#x5B8C;&#x6210;</li>
</ol>
<pre><code>unction insertSort(arr) {
  let len = arr.length;
  for (let i = 1; i &lt; len; i++) {
    let tmp = arr[i];
    let j = i - 1;
    while (j &gt;= 0 &amp;&amp; tmp &lt; arr[j]) {
      arr[j + 1] = arr[j];
      j--;
    }
    arr[j + 1] = tmp
  }
  return arr
}
console.log(insertSort([2, 4, 6, 80, 100, 5, 0]))
</code></pre><h3 id="&#x4E94;&#x3001;&#x5F52;&#x5E76;&#x6392;&#x5E8F;">&#x4E94;&#x3001;&#x5F52;&#x5E76;&#x6392;&#x5E8F;</h3>
<p>&#x5C06;&#x4E24;&#x4E2A;&#x7684;&#x6709;&#x5E8F;&#x6570;&#x5217;&#x5408;&#x5E76;&#x6210;&#x4E00;&#x4E2A;&#x6709;&#x5E8F;&#x6570;&#x5217;&#xFF0C;&#x6211;&#x4EEC;&#x79F0;&#x4E4B;&#x4E3A;&quot;&#x5F52;&#x5E76;&quot;&#xFF0C;&#x5F52;&#x5E76;&#x6392;&#x5E8F;&#x7684;&#x601D;&#x60F3;&#x5C31;&#x662F;&#x5C06;&#x4E00;&#x7CFB;&#x5217;&#x6392;&#x5E8F;&#x597D;&#x7684;&#x5B50;&#x5E8F;&#x5217;&#x5408;&#x5E76;&#x6210;&#x4E00;&#x4E2A;&#x5927;&#x7684;&#x5B8C;&#x6574;&#x6709;&#x5E8F;&#x7684;&#x5E8F;&#x5217;&#x3002;</p>
<p>&#x5B9E;&#x73B0;&#x6B65;&#x9AA4;&#x5982;&#x4E0B;&#xFF1A;</p>
<ol>
<li>&#x628A;&#x957F;&#x5EA6;&#x4E3A;n&#x7684;&#x8F93;&#x5165;&#x5E8F;&#x5217;&#x5206;&#x6210;&#x4E24;&#x4E2A;&#x957F;&#x5EA6;&#x4E3A;n/2&#x7684;&#x5B50;&#x5E8F;&#x5217;&#xFF1B;</li>
<li>&#x5BF9;&#x8FD9;&#x4E24;&#x4E2A;&#x5B50;&#x5E8F;&#x5217;&#x5206;&#x522B;&#x91C7;&#x7528;&#x5F52;&#x5E76;&#x6392;&#x5E8F;&#xFF1B;</li>
<li>&#x5C06;&#x4E24;&#x4E2A;&#x6392;&#x5E8F;&#x597D;&#x7684;&#x5B50;&#x5E8F;&#x5217;&#x5408;&#x5E76;&#x6210;&#x4E00;&#x4E2A;&#x6700;&#x7EC8;&#x7684;&#x6392;&#x5E8F;&#x5E8F;&#x5217;</li>
</ol>
<pre><code>function mergeSort(arr) {
  if (arr.length &lt; 2) {
    return arr
  }
  let mid = Math.floor(arr.length / 2);
  let left = arr.slice(0, mid);
  let right = arr.slice(mid);
  return merge(mergeSort(left), mergeSort(right));

  function merge(left, right) {
    let result = [];
    while (left.length &gt; 0 &amp;&amp; right.length &gt; 0) {
      if (left[0] &gt; right[0]) {
        result.push(right.shift())
      } else {
        result.push(left.shift())
      }
    }
    return result.concat(left, right)
  }
}
console.log(mergeSort([2, 4, 6, 80, 100, 5, 0]))
</code></pre>
                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="执行上下文.html" class="navigation navigation-prev " aria-label="Previous page: 1.2. 执行上下文">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="原型原型链继承.html" class="navigation navigation-next " aria-label="Next page: 1.4. 原型、原型链、继承">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"1.3. 排序算法","level":"2.1.3","depth":2,"next":{"title":"1.4. 原型、原型链、继承","level":"2.1.4","depth":2,"path":"javaScript/原型原型链继承.md","ref":"./javaScript/原型原型链继承.md","articles":[]},"previous":{"title":"1.2. 执行上下文","level":"2.1.2","depth":2,"path":"javaScript/执行上下文.md","ref":"./javaScript/执行上下文.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":[],"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"javaScript/排序算法.md","mtime":"2018-03-22T15:10:42.439Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2018-06-01T09:32:09.773Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

